node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 17500
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 17500
          }
        }
        string_val: "/notebooks/data/train/cat.2931.jpg"
        string_val: "/notebooks/data/train/cat.9337.jpg"
        string_val: "/notebooks/data/train/dog.5439.jpg"
        string_val: "/notebooks/data/train/cat.3619.jpg"
        string_val: "/notebooks/data/train/cat.5360.jpg"
        string_val: "/notebooks/data/train/cat.294.jpg"
        string_val: "/notebooks/data/train/cat.6304.jpg"
        string_val: "/notebooks/data/train/dog.7877.jpg"
        string_val: "/notebooks/data/train/dog.1406.jpg"
        string_val: "/notebooks/data/train/dog.2157.jpg"
        string_val: "/notebooks/data/train/dog.2242.jpg"
        string_val: "/notebooks/data/train/cat.6155.jpg"
        string_val: "/notebooks/data/train/dog.12052.jpg"
        string_val: "/notebooks/data/train/cat.10317.jpg"
        string_val: "/notebooks/data/train/dog.10218.jpg"
        string_val: "/notebooks/data/train/dog.3131.jpg"
        string_val: "/notebooks/data/train/cat.2683.jpg"
        string_val: "/notebooks/data/train/dog.6786.jpg"
        string_val: "/notebooks/data/train/dog.10460.jpg"
        string_val: "/notebooks/data/train/dog.3459.jpg"
        string_val: "/notebooks/data/train/dog.2624.jpg"
        string_val: "/notebooks/data/train/cat.11535.jpg"
        string_val: "/notebooks/data/train/cat.8984.jpg"
        string_val: "/notebooks/data/train/cat.8771.jpg"
        string_val: "/notebooks/data/train/dog.3555.jpg"
        string_val: "/notebooks/data/train/cat.5536.jpg"
        string_val: "/notebooks/data/train/dog.3773.jpg"
        string_val: "/notebooks/data/train/dog.10981.jpg"
        string_val: "/notebooks/data/train/dog.8659.jpg"
        string_val: "/notebooks/data/train/cat.9247.jpg"
        string_val: "/notebooks/data/train/dog.6355.jpg"
        string_val: "/notebooks/data/train/dog.12383.jpg"
        string_val: "/notebooks/data/train/dog.11301.jpg"
        string_val: "/notebooks/data/train/dog.891.jpg"
        string_val: "/notebooks/data/train/cat.2438.jpg"
        string_val: "/notebooks/data/train/dog.9681.jpg"
        string_val: "/notebooks/data/train/dog.11391.jpg"
        string_val: "/notebooks/data/train/cat.2976.jpg"
        string_val: "/notebooks/data/train/dog.7905.jpg"
        string_val: "/notebooks/data/train/cat.10729.jpg"
        string_val: "/notebooks/data/train/dog.12164.jpg"
        string_val: "/notebooks/data/train/cat.4230.jpg"
        string_val: "/notebooks/data/train/dog.9159.jpg"
        string_val: "/notebooks/data/train/cat.1741.jpg"
        string_val: "/notebooks/data/train/dog.4634.jpg"
        string_val: "/notebooks/data/train/dog.9514.jpg"
        string_val: "/notebooks/data/train/cat.8066.jpg"
        string_val: "/notebooks/data/train/cat.8661.jpg"
        string_val: "/notebooks/data/train/dog.6973.jpg"
        string_val: "/notebooks/data/train/dog.212.jpg"
        string_val: "/notebooks/data/train/dog.1218.jpg"
        string_val: "/notebooks/data/train/cat.9295.jpg"
        string_val: "/notebooks/data/train/dog.1010.jpg"
        string_val: "/notebooks/data/train/cat.4996.jpg"
        string_val: "/notebooks/data/train/dog.12111.jpg"
        string_val: "/notebooks/data/train/dog.9410.jpg"
        string_val: "/notebooks/data/train/cat.6134.jpg"
        string_val: "/notebooks/data/train/dog.6203.jpg"
        string_val: "/notebooks/data/train/cat.5318.jpg"
        string_val: "/notebooks/data/train/dog.2469.jpg"
        string_val: "/notebooks/data/train/cat.5604.jpg"
        string_val: "/notebooks/data/train/dog.8846.jpg"
        string_val: "/notebooks/data/train/dog.7704.jpg"
        string_val: "/notebooks/data/train/cat.985.jpg"
        string_val: "/notebooks/data/train/cat.2823.jpg"
        string_val: "/notebooks/data/train/dog.2879.jpg"
        string_val: "/notebooks/data/train/dog.5612.jpg"
        string_val: "/notebooks/data/train/cat.7686.jpg"
        string_val: "/notebooks/data/train/cat.7306.jpg"
        string_val: "/notebooks/data/train/dog.5692.jpg"
        string_val: "/notebooks/data/train/cat.964.jpg"
        string_val: "/notebooks/data/train/cat.9866.jpg"
        string_val: "/notebooks/data/train/dog.7414.jpg"
        string_val: "/notebooks/data/train/dog.6549.jpg"
        string_val: "/notebooks/data/train/cat.597.jpg"
        string_val: "/notebooks/data/train/dog.10680.jpg"
        string_val: "/notebooks/data/train/cat.1697.jpg"
        string_val: "/notebooks/data/train/cat.2019.jpg"
        string_val: "/notebooks/data/train/cat.7562.jpg"
        string_val: "/notebooks/data/train/dog.11630.jpg"
        string_val: "/notebooks/data/train/cat.8079.jpg"
        string_val: "/notebooks/data/train/cat.2122.jpg"
        string_val: "/notebooks/data/train/cat.2993.jpg"
        string_val: "/notebooks/data/train/dog.2662.jpg"
        string_val: "/notebooks/data/train/dog.5423.jpg"
        string_val: "/notebooks/data/train/cat.4574.jpg"
        string_val: "/notebooks/data/train/cat.10004.jpg"
        string_val: "/notebooks/data/train/dog.11486.jpg"
        string_val: "/notebooks/data/train/cat.1157.jpg"
        string_val: "/notebooks/data/train/dog.9341.jpg"
        string_val: "/notebooks/data/train/dog.4676.jpg"
        string_val: "/notebooks/data/train/dog.8641.jpg"
        string_val: "/notebooks/data/train/cat.4569.jpg"
        string_val: "/notebooks/data/train/cat.4214.jpg"
        string_val: "/notebooks/data/train/dog.2850.jpg"
        string_val: "/notebooks/data/train/cat.706.jpg"
        string_val: "/notebooks/data/train/dog.5472.jpg"
        string_val: "/notebooks/data/train/cat.3221.jpg"
        string_val: "/notebooks/data/train/cat.6414.jpg"
        string_val: "/notebooks/data/train/cat.9632.jpg"
        string_val: "/notebooks/data/train/cat.12140.jpg"
        string_val: "/notebooks/data/train/dog.10084.jpg"
        string_val: "/notebooks/data/train/dog.11670.jpg"
        string_val: "/notebooks/data/train/dog.35.jpg"
        string_val: "/notebooks/data/train/cat.10307.jpg"
        string_val: "/notebooks/data/train/cat.7863.jpg"
        string_val: "/notebooks/data/train/cat.12122.jpg"
        string_val: "/notebooks/data/train/cat.147.jpg"
        string_val: "/notebooks/data/train/cat.2506.jpg"
        string_val: "/notebooks/data/train/dog.10481.jpg"
        string_val: "/notebooks/data/train/cat.2865.jpg"
        string_val: "/notebooks/data/train/dog.757.jpg"
        string_val: "/notebooks/data/train/cat.993.jpg"
        string_val: "/notebooks/data/train/dog.1526.jpg"
        string_val: "/notebooks/data/train/dog.3072.jpg"
        string_val: "/notebooks/data/train/dog.409.jpg"
        string_val: "/notebooks/data/train/cat.3335.jpg"
        string_val: "/notebooks/data/train/cat.5188.jpg"
        string_val: "/notebooks/data/train/dog.5263.jpg"
        string_val: "/notebooks/data/train/dog.498.jpg"
        string_val: "/notebooks/data/train/dog.8109.jpg"
        string_val: "/notebooks/data/train/dog.11.jpg"
        string_val: "/notebooks/data/train/cat.6226.jpg"
        string_val: "/notebooks/data/train/cat.4461.jpg"
        string_val: "/notebooks/data/train/cat.6913.jpg"
        string_val: "/notebooks/data/train/cat.12334.jpg"
        string_val: "/notebooks/data/train/cat.1914.jpg"
        string_val: "/notebooks/data/train/cat.5913.jpg"
        string_val: "/notebooks/data/train/dog.3784.jpg"
        string_val: "/notebooks/data/train/dog.972.jpg"
        string_val: "/notebooks/data/train/dog.5946.jpg"
        string_val: "/notebooks/data/train/dog.4772.jpg"
        string_val: "/notebooks/data/train/cat.1125.jpg"
        string_val: "/notebooks/data/train/cat.6247.jpg"
        string_val: "/notebooks/data/train/dog.4575.jpg"
        string_val: "/notebooks/data/train/dog.1273.jpg"
        string_val: "/notebooks/data/train/dog.11866.jpg"
        string_val: "/notebooks/data/train/cat.8222.jpg"
        string_val: "/notebooks/data/train/dog.1062.jpg"
        string_val: "/notebooks/data/train/dog.9375.jpg"
        string_val: "/notebooks/data/train/dog.6319.jpg"
        string_val: "/notebooks/data/train/dog.11636.jpg"
        string_val: "/notebooks/data/train/cat.3657.jpg"
        string_val: "/notebooks/data/train/cat.4526.jpg"
        string_val: "/notebooks/data/train/dog.8016.jpg"
        string_val: "/notebooks/data/train/dog.9810.jpg"
        string_val: "/notebooks/data/train/dog.12272.jpg"
        string_val: "/notebooks/data/train/cat.3661.jpg"
        string_val: "/notebooks/data/train/cat.86.jpg"
        string_val: "/notebooks/data/train/dog.2886.jpg"
        string_val: "/notebooks/data/train/cat.10756.jpg"
        string_val: "/notebooks/data/train/dog.9487.jpg"
        string_val: "/notebooks/data/train/cat.11776.jpg"
        string_val: "/notebooks/data/train/cat.10389.jpg"
        string_val: "/notebooks/data/train/dog.9385.jpg"
        string_val: "/notebooks/data/train/cat.1005.jpg"
        string_val: "/notebooks/data/train/cat.4936.jpg"
        string_val: "/notebooks/data/train/dog.389.jpg"
        string_val: "/notebooks/data/train/dog.9255.jpg"
        string_val: "/notebooks/data/train/cat.3182.jpg"
        string_val: "/notebooks/data/train/dog.10151.jpg"
        string_val: "/notebooks/data/train/dog.234.jpg"
        string_val: "/notebooks/data/train/cat.8937.jpg"
        string_val: "/notebooks/data/train/dog.10385.jpg"
        string_val: "/notebooks/data/train/cat.5073.jpg"
        string_val: "/notebooks/data/train/cat.6082.jpg"
        string_val: "/notebooks/data/train/dog.3360.jpg"
        string_val: "/notebooks/data/train/cat.12.jpg"
        string_val: "/notebooks/data/train/dog.7232.jpg"
        string_val: "/notebooks/data/train/cat.7455.jpg"
        string_val: "/notebooks/data/train/cat.6766.jpg"
        string_val: "/notebooks/data/train/cat.2805.jpg"
        string_val: "/notebooks/data/train/dog.1184.jpg"
        string_val: "/notebooks/data/train/dog.4169.jpg"
        string_val: "/notebooks/data/train/cat.4681.jpg"
        string_val: "/notebooks/data/train/dog.3265.jpg"
        string_val: "/notebooks/data/train/cat.9410.jpg"
        string_val: "/notebooks/data/train/dog.7155.jpg"
        string_val: "/notebooks/data/train/dog.11794.jpg"
        string_val: "/notebooks/data/train/cat.559.jpg"
        string_val: "/notebooks/data/train/dog.8351.jpg"
        string_val: "/notebooks/data/train/cat.7605.jpg"
        string_val: "/notebooks/data/train/cat.11763.jpg"
        string_val: "/notebooks/data/train/cat.3955.jpg"
        string_val: "/notebooks/data/train/dog.1902.jpg"
        string_val: "/notebooks/data/train/cat.6267.jpg"
        string_val: "/notebooks/data/train/dog.9646.jpg"
        string_val: "/notebooks/data/train/dog.10831.jpg"
        string_val: "/notebooks/data/train/dog.11165.jpg"
        string_val: "/notebooks/data/train/dog.6817.jpg"
        string_val: "/notebooks/data/train/cat.5855.jpg"
        string_val: "/notebooks/data/train/dog.10166.jpg"
        string_val: "/notebooks/data/train/cat.9829.jpg"
        string_val: "/notebooks/data/train/dog.10119.jpg"
        string_val: "/notebooks/data/train/dog.11667.jpg"
        string_val: "/notebooks/data/train/cat.7888.jpg"
        string_val: "/notebooks/data/train/dog.6891.jpg"
        string_val: "/notebooks/data/train/dog.5288.jpg"
        string_val: "/notebooks/data/train/cat.6636.jpg"
        string_val: "/notebooks/data/train/cat.6728.jpg"
        string_val: "/notebooks/data/train/dog.974.jpg"
        string_val: "/notebooks/data/train/cat.302.jpg"
        string_val: "/notebooks/data/train/dog.1560.jpg"
        string_val: "/notebooks/data/train/cat.4333.jpg"
        string_val: "/notebooks/data/train/dog.8554.jpg"
        string_val: "/notebooks/data/train/cat.192.jpg"
        string_val: "/notebooks/data/train/cat.1917.jpg"
        string_val: "/notebooks/data/train/cat.9153.jpg"
        string_val: "/notebooks/data/train/cat.3613.jpg"
        string_val: "/notebooks/data/train/cat.983.jpg"
        string_val: "/notebooks/data/train/dog.6502.jpg"
        string_val: "/notebooks/data/train/cat.4718.jpg"
        string_val: "/notebooks/data/train/dog.1471.jpg"
        string_val: "/notebooks/data/train/dog.3647.jpg"
        string_val: "/notebooks/data/train/cat.2842.jpg"
        string_val: "/notebooks/data/train/dog.4202.jpg"
        string_val: "/notebooks/data/train/dog.6506.jpg"
        string_val: "/notebooks/data/train/cat.7203.jpg"
        string_val: "/notebooks/data/train/cat.11809.jpg"
        string_val: "/notebooks/data/train/dog.11379.jpg"
        string_val: "/notebooks/data/train/cat.1994.jpg"
        string_val: "/notebooks/data/train/dog.7401.jpg"
        string_val: "/notebooks/data/train/cat.3065.jpg"
        string_val: "/notebooks/data/train/cat.8290.jpg"
        string_val: "/notebooks/data/train/dog.7327.jpg"
        string_val: "/notebooks/data/train/cat.314.jpg"
        string_val: "/notebooks/data/train/cat.5303.jpg"
        string_val: "/notebooks/data/train/dog.11901.jpg"
        string_val: "/notebooks/data/train/dog.10778.jpg"
        string_val: "/notebooks/data/train/cat.7364.jpg"
        string_val: "/notebooks/data/train/cat.9542.jpg"
        string_val: "/notebooks/data/train/cat.817.jpg"
        string_val: "/notebooks/data/train/cat.121.jpg"
        string_val: "/notebooks/data/train/cat.3503.jpg"
        string_val: "/notebooks/data/train/dog.8431.jpg"
        string_val: "/notebooks/data/train/dog.7161.jpg"
        string_val: "/notebooks/data/train/dog.5437.jpg"
        string_val: "/notebooks/data/train/dog.1748.jpg"
        string_val: "/notebooks/data/train/cat.2.jpg"
        string_val: "/notebooks/data/train/cat.9179.jpg"
        string_val: "/notebooks/data/train/dog.11067.jpg"
        string_val: "/notebooks/data/train/cat.12045.jpg"
        string_val: "/notebooks/data/train/cat.5618.jpg"
        string_val: "/notebooks/data/train/dog.10592.jpg"
        string_val: "/notebooks/data/train/cat.1269.jpg"
        string_val: "/notebooks/data/train/cat.11117.jpg"
        string_val: "/notebooks/data/train/cat.6027.jpg"
        string_val: "/notebooks/data/train/dog.9761.jpg"
        string_val: "/notebooks/data/train/cat.12362.jpg"
        string_val: "/notebooks/data/train/cat.9688.jpg"
        string_val: "/notebooks/data/train/cat.2164.jpg"
        string_val: "/notebooks/data/train/cat.7673.jpg"
        string_val: "/notebooks/data/train/cat.164.jpg"
        string_val: "/notebooks/data/train/cat.11887.jpg"
        string_val: "/notebooks/data/train/dog.11770.jpg"
        string_val: "/notebooks/data/train/cat.11721.jpg"
        string_val: "/notebooks/data/train/cat.11560.jpg"
        string_val: "/notebooks/data/train/cat.9609.jpg"
        string_val: "/notebooks/data/train/cat.6297.jpg"
        string_val: "/notebooks/data/train/cat.12153.jpg"
        string_val: "/notebooks/data/train/dog.5013.jpg"
        string_val: "/notebooks/data/train/cat.4182.jpg"
        string_val: "/notebooks/data/train/dog.11093.jpg"
        string_val: "/notebooks/data/train/dog.6844.jpg"
        string_val: "/notebooks/data/train/dog.8802.jpg"
        string_val: "/notebooks/data/train/cat.4011.jpg"
        string_val: "/notebooks/data/train/dog.8203.jpg"
        string_val: "/notebooks/data/train/cat.1297.jpg"
        string_val: "/notebooks/data/train/dog.2249.jpg"
        string_val: "/notebooks/data/train/dog.3558.jpg"
        string_val: "/notebooks/data/train/dog.3824.jpg"
        string_val: "/notebooks/data/train/cat.917.jpg"
        string_val: "/notebooks/data/train/cat.6292.jpg"
        string_val: "/notebooks/data/train/cat.9462.jpg"
        string_val: "/notebooks/data/train/dog.8516.jpg"
        string_val: "/notebooks/data/train/dog.3456.jpg"
        string_val: "/notebooks/data/train/dog.9278.jpg"
        string_val: "/notebooks/data/train/cat.1581.jpg"
        string_val: "/notebooks/data/train/dog.9479.jpg"
        string_val: "/notebooks/data/train/dog.12212.jpg"
        string_val: "/notebooks/data/train/cat.9700.jpg"
        string_val: "/notebooks/data/train/dog.4058.jpg"
        string_val: "/notebooks/data/train/cat.4171.jpg"
        string_val: "/notebooks/data/train/dog.4792.jpg"
        string_val: "/notebooks/data/train/dog.11930.jpg"
        string_val: "/notebooks/data/train/dog.153.jpg"
        string_val: "/notebooks/data/train/cat.2816.jpg"
        string_val: "/notebooks/data/train/dog.2271.jpg"
        string_val: "/notebooks/data/train/dog.10003.jpg"
        string_val: "/notebooks/data/train/cat.10489.jpg"
        string_val: "/notebooks/data/train/cat.4670.jpg"
        string_val: "/notebooks/data/train/dog.9572.jpg"
        string_val: "/notebooks/data/train/cat.2774.jpg"
        string_val: "/notebooks/data/train/cat.7688.jpg"
        string_val: "/notebooks/data/train/dog.5622.jpg"
        string_val: "/notebooks/data/train/cat.6690.jpg"
        string_val: "/notebooks/data/train/dog.6412.jpg"
        string_val: "/notebooks/data/train/dog.170.jpg"
        string_val: "/notebooks/data/train/cat.3499.jpg"
        string_val: "/notebooks/data/train/cat.8170.jpg"
        string_val: "/notebooks/data/train/cat.8346.jpg"
        string_val: "/notebooks/data/train/cat.5032.jpg"
        string_val: "/notebooks/data/train/cat.9702.jpg"
        string_val: "/notebooks/data/train/dog.5680.jpg"
        string_val: "/notebooks/data/train/dog.9890.jpg"
        string_val: "/notebooks/data/train/dog.10149.jpg"
        string_val: "/notebooks/data/train/cat.10053.jpg"
        string_val: "/notebooks/data/train/cat.10349.jpg"
        string_val: "/notebooks/data/train/dog.6262.jpg"
        string_val: "/notebooks/data/train/dog.10692.jpg"
        string_val: "/notebooks/data/train/cat.11369.jpg"
        string_val: "/notebooks/data/train/cat.8595.jpg"
        string_val: "/notebooks/data/train/cat.567.jpg"
        string_val: "/notebooks/data/train/dog.9237.jpg"
        string_val: "/notebooks/data/train/dog.8476.jpg"
        string_val: "/notebooks/data/train/cat.8311.jpg"
        string_val: "/notebooks/data/train/cat.733.jpg"
        string_val: "/notebooks/data/train/dog.3149.jpg"
        string_val: "/notebooks/data/train/cat.10318.jpg"
        string_val: "/notebooks/data/train/cat.2753.jpg"
        string_val: "/notebooks/data/train/cat.7350.jpg"
        string_val: "/notebooks/data/train/cat.6776.jpg"
        string_val: "/notebooks/data/train/cat.11223.jpg"
        string_val: "/notebooks/data/train/cat.12184.jpg"
        string_val: "/notebooks/data/train/cat.2711.jpg"
        string_val: "/notebooks/data/train/cat.6526.jpg"
        string_val: "/notebooks/data/train/dog.5554.jpg"
        string_val: "/notebooks/data/train/cat.3257.jpg"
        string_val: "/notebooks/data/train/cat.5224.jpg"
        string_val: "/notebooks/data/train/dog.6159.jpg"
        string_val: "/notebooks/data/train/dog.12325.jpg"
        string_val: "/notebooks/data/train/cat.1904.jpg"
        string_val: "/notebooks/data/train/cat.874.jpg"
        string_val: "/notebooks/data/train/dog.8475.jpg"
        string_val: "/notebooks/data/train/cat.2437.jpg"
        string_val: "/notebooks/data/train/cat.10807.jpg"
        string_val: "/notebooks/data/train/cat.7883.jpg"
        string_val: "/notebooks/data/train/dog.2370.jpg"
        string_val: "/notebooks/data/train/dog.254.jpg"
        string_val: "/notebooks/data/train/dog.6201.jpg"
        string_val: "/notebooks/data/train/dog.5192.jpg"
        string_val: "/notebooks/data/train/cat.7392.jpg"
        string_val: "/notebooks/data/train/cat.4939.jpg"
        string_val: "/notebooks/data/train/cat.2621.jpg"
        string_val: "/notebooks/data/train/dog.12430.jpg"
        string_val: "/notebooks/data/train/cat.4502.jpg"
        string_val: "/notebooks/data/train/cat.11279.jpg"
        string_val: "/notebooks/data/train/dog.10381.jpg"
        string_val: "/notebooks/data/train/cat.5892.jpg"
        string_val: "/notebooks/data/train/dog.5581.jpg"
        string_val: "/notebooks/data/train/cat.7120.jpg"
        string_val: "/notebooks/data/train/cat.6511.jpg"
        string_val: "/notebooks/data/train/dog.9764.jpg"
        string_val: "/notebooks/data/train/cat.6462.jpg"
        string_val: "/notebooks/data/train/cat.5317.jpg"
        string_val: "/notebooks/data/train/dog.5686.jpg"
        string_val: "/notebooks/data/train/cat.11741.jpg"
        string_val: "/notebooks/data/train/dog.7907.jpg"
        string_val: "/notebooks/data/train/cat.10587.jpg"
        string_val: "/notebooks/data/train/cat.1506.jpg"
        string_val: "/notebooks/data/train/cat.890.jpg"
        string_val: "/notebooks/data/train/cat.5909.jpg"
        string_val: "/notebooks/data/train/cat.4699.jpg"
        string_val: "/notebooks/data/train/dog.8712.jpg"
        string_val: "/notebooks/data/train/cat.447.jpg"
        string_val: "/notebooks/data/train/dog.6815.jpg"
        string_val: "/notebooks/data/train/dog.5174.jpg"
        string_val: "/notebooks/data/train/cat.1126.jpg"
        string_val: "/notebooks/data/train/dog.1399.jpg"
        string_val: "/notebooks/data/train/cat.12467.jpg"
        string_val: "/notebooks/data/train/dog.2038.jpg"
        string_val: "/notebooks/data/train/cat.4737.jpg"
        string_val: "/notebooks/data/train/cat.2047.jpg"
        string_val: "/notebooks/data/train/cat.3759.jpg"
        string_val: "/notebooks/data/train/dog.9756.jpg"
        string_val: "/notebooks/data/train/cat.6327.jpg"
        string_val: "/notebooks/data/train/dog.1317.jpg"
        string_val: "/notebooks/data/train/dog.818.jpg"
        string_val: "/notebooks/data/train/cat.415.jpg"
        string_val: "/notebooks/data/train/cat.11908.jpg"
        string_val: "/notebooks/data/train/dog.6588.jpg"
        string_val: "/notebooks/data/train/dog.6922.jpg"
        string_val: "/notebooks/data/train/cat.10074.jpg"
        string_val: "/notebooks/data/train/dog.3508.jpg"
        string_val: "/notebooks/data/train/dog.8446.jpg"
        string_val: "/notebooks/data/train/dog.3561.jpg"
        string_val: "/notebooks/data/train/cat.4772.jpg"
        string_val: "/notebooks/data/train/dog.5539.jpg"
        string_val: "/notebooks/data/train/dog.4066.jpg"
        string_val: "/notebooks/data/train/cat.9301.jpg"
        string_val: "/notebooks/data/train/dog.2724.jpg"
        string_val: "/notebooks/data/train/cat.3622.jpg"
        string_val: "/notebooks/data/train/dog.2295.jpg"
        string_val: "/notebooks/data/train/dog.12077.jpg"
        string_val: "/notebooks/data/train/dog.1281.jpg"
        string_val: "/notebooks/data/train/cat.3181.jpg"
        string_val: "/notebooks/data/train/cat.11707.jpg"
        string_val: "/notebooks/data/train/dog.8352.jpg"
        string_val: "/notebooks/data/train/cat.2175.jpg"
        string_val: "/notebooks/data/train/dog.5173.jpg"
        string_val: "/notebooks/data/train/cat.3108.jpg"
        string_val: "/notebooks/data/train/cat.5350.jpg"
        string_val: "/notebooks/data/train/cat.1628.jpg"
        string_val: "/notebooks/data/train/cat.2316.jpg"
        string_val: "/notebooks/data/train/dog.4477.jpg"
        string_val: "/notebooks/data/train/dog.24.jpg"
        string_val: "/notebooks/data/train/cat.10382.jpg"
        string_val: "/notebooks/data/train/cat.12036.jpg"
        string_val: "/notebooks/data/train/cat.2491.jpg"
        string_val: "/notebooks/data/train/dog.760.jpg"
        string_val: "/notebooks/data/train/dog.5142.jpg"
        string_val: "/notebooks/data/train/dog.10504.jpg"
        string_val: "/notebooks/data/train/dog.9213.jpg"
        string_val: "/notebooks/data/train/dog.663.jpg"
        string_val: "/notebooks/data/train/cat.2031.jpg"
        string_val: "/notebooks/data/train/cat.1017.jpg"
        string_val: "/notebooks/data/train/cat.4717.jpg"
        string_val: "/notebooks/data/train/dog.12213.jpg"
        string_val: "/notebooks/data/train/cat.11052.jpg"
        string_val: "/notebooks/data/train/cat.5282.jpg"
        string_val: "/notebooks/data/train/cat.2940.jpg"
        string_val: "/notebooks/data/train/dog.2733.jpg"
        string_val: "/notebooks/data/train/cat.4054.jpg"
        string_val: "/notebooks/data/train/dog.7771.jpg"
        string_val: "/notebooks/data/train/dog.539.jpg"
        string_val: "/notebooks/data/train/cat.10910.jpg"
        string_val: "/notebooks/data/train/cat.2941.jpg"
        string_val: "/notebooks/data/train/dog.7170.jpg"
        string_val: "/notebooks/data/train/dog.3986.jpg"
        string_val: "/notebooks/data/train/dog.9705.jpg"
        string_val: "/notebooks/data/train/cat.5780.jpg"
        string_val: "/notebooks/data/train/cat.1826.jpg"
        string_val: "/notebooks/data/train/cat.8050.jpg"
        string_val: "/notebooks/data/train/cat.11765.jpg"
        string_val: "/notebooks/data/train/cat.5110.jpg"
        string_val: "/notebooks/data/train/dog.10404.jpg"
        string_val: "/notebooks/data/train/cat.11305.jpg"
        string_val: "/notebooks/data/train/dog.7815.jpg"
        string_val: "/notebooks/data/train/dog.8981.jpg"
        string_val: "/notebooks/data/train/dog.319.jpg"
        string_val: "/notebooks/data/train/cat.5295.jpg"
        string_val: "/notebooks/data/train/cat.10727.jpg"
        string_val: "/notebooks/data/train/dog.3941.jpg"
        string_val: "/notebooks/data/train/dog.68.jpg"
        string_val: "/notebooks/data/train/cat.3439.jpg"
        string_val: "/notebooks/data/train/cat.1459.jpg"
        string_val: "/notebooks/data/train/cat.10167.jpg"
        string_val: "/notebooks/data/train/dog.10368.jpg"
        string_val: "/notebooks/data/train/cat.8676.jpg"
        string_val: "/notebooks/data/train/cat.4046.jpg"
        string_val: "/notebooks/data/train/cat.11934.jpg"
        string_val: "/notebooks/data/train/cat.7815.jpg"
        string_val: "/notebooks/data/train/dog.2361.jpg"
        string_val: "/notebooks/data/train/cat.4151.jpg"
        string_val: "/notebooks/data/train/dog.1108.jpg"
        string_val: "/notebooks/data/train/dog.3400.jpg"
        string_val: "/notebooks/data/train/dog.10739.jpg"
        string_val: "/notebooks/data/train/cat.1081.jpg"
        string_val: "/notebooks/data/train/cat.10986.jpg"
        string_val: "/notebooks/data/train/cat.8175.jpg"
        string_val: "/notebooks/data/train/cat.271.jpg"
        string_val: "/notebooks/data/train/cat.1304.jpg"
        string_val: "/notebooks/data/train/dog.7074.jpg"
        string_val: "/notebooks/data/train/cat.8372.jpg"
        string_val: "/notebooks/data/train/cat.5185.jpg"
        string_val: "/notebooks/data/train/cat.11459.jpg"
        string_val: "/notebooks/data/train/dog.8424.jpg"
        string_val: "/notebooks/data/train/dog.5782.jpg"
        string_val: "/notebooks/data/train/cat.6881.jpg"
        string_val: "/notebooks/data/train/cat.9399.jpg"
        string_val: "/notebooks/data/train/cat.4957.jpg"
        string_val: "/notebooks/data/train/cat.3329.jpg"
        string_val: "/notebooks/data/train/cat.2091.jpg"
        string_val: "/notebooks/data/train/dog.9036.jpg"
        string_val: "/notebooks/data/train/cat.12154.jpg"
        string_val: "/notebooks/data/train/dog.2270.jpg"
        string_val: "/notebooks/data/train/dog.358.jpg"
        string_val: "/notebooks/data/train/cat.7396.jpg"
        string_val: "/notebooks/data/train/dog.4360.jpg"
        string_val: "/notebooks/data/train/cat.11906.jpg"
        string_val: "/notebooks/data/train/cat.11658.jpg"
        string_val: "/notebooks/data/train/cat.1072.jpg"
        string_val: "/notebooks/data/train/dog.3850.jpg"
        string_val: "/notebooks/data/train/cat.9350.jpg"
        string_val: "/notebooks/data/train/dog.95.jpg"
        string_val: "/notebooks/data/train/dog.7447.jpg"
        string_val: "/notebooks/data/train/dog.641.jpg"
        string_val: "/notebooks/data/train/cat.816.jpg"
        string_val: "/notebooks/data/train/cat.908.jpg"
        string_val: "/notebooks/data/train/cat.195.jpg"
        string_val: "/notebooks/data/train/dog.2726.jpg"
        string_val: "/notebooks/data/train/cat.3177.jpg"
        string_val: "/notebooks/data/train/dog.6435.jpg"
        string_val: "/notebooks/data/train/cat.8997.jpg"
        string_val: "/notebooks/data/train/dog.6699.jpg"
        string_val: "/notebooks/data/train/dog.4025.jpg"
        string_val: "/notebooks/data/train/cat.10178.jpg"
        string_val: "/notebooks/data/train/cat.1698.jpg"
        string_val: "/notebooks/data/train/cat.8133.jpg"
        string_val: "/notebooks/data/train/cat.10792.jpg"
        string_val: "/notebooks/data/train/cat.8427.jpg"
        string_val: "/notebooks/data/train/dog.1695.jpg"
        string_val: "/notebooks/data/train/dog.10278.jpg"
        string_val: "/notebooks/data/train/dog.11818.jpg"
        string_val: "/notebooks/data/train/dog.3694.jpg"
        string_val: "/notebooks/data/train/dog.10940.jpg"
        string_val: "/notebooks/data/train/cat.10419.jpg"
        string_val: "/notebooks/data/train/dog.4789.jpg"
        string_val: "/notebooks/data/train/dog.11201.jpg"
        string_val: "/notebooks/data/train/cat.11358.jpg"
        string_val: "/notebooks/data/train/dog.469.jpg"
        string_val: "/notebooks/data/train/cat.10638.jpg"
        string_val: "/notebooks/data/train/dog.4486.jpg"
        string_val: "/notebooks/data/train/cat.1147.jpg"
        string_val: "/notebooks/data/train/cat.7948.jpg"
        string_val: "/notebooks/data/train/dog.8491.jpg"
        string_val: "/notebooks/data/train/dog.3225.jpg"
        string_val: "/notebooks/data/train/dog.9773.jpg"
        string_val: "/notebooks/data/train/dog.4595.jpg"
        string_val: "/notebooks/data/train/cat.3580.jpg"
        string_val: "/notebooks/data/train/cat.3168.jpg"
        string_val: "/notebooks/data/train/dog.7765.jpg"
        string_val: "/notebooks/data/train/dog.11253.jpg"
        string_val: "/notebooks/data/train/cat.9367.jpg"
        string_val: "/notebooks/data/train/dog.2278.jpg"
        string_val: "/notebooks/data/train/cat.2003.jpg"
        string_val: "/notebooks/data/train/cat.8805.jpg"
        string_val: "/notebooks/data/train/dog.1195.jpg"
        string_val: "/notebooks/data/train/cat.4584.jpg"
        string_val: "/notebooks/data/train/dog.3363.jpg"
        string_val: "/notebooks/data/train/dog.12437.jpg"
        string_val: "/notebooks/data/train/cat.10046.jpg"
        string_val: "/notebooks/data/train/dog.3189.jpg"
        string_val: "/notebooks/data/train/dog.90.jpg"
        string_val: "/notebooks/data/train/cat.5076.jpg"
        string_val: "/notebooks/data/train/cat.11349.jpg"
        string_val: "/notebooks/data/train/dog.11470.jpg"
        string_val: "/notebooks/data/train/cat.12229.jpg"
        string_val: "/notebooks/data/train/cat.2262.jpg"
        string_val: "/notebooks/data/train/dog.10725.jpg"
        string_val: "/notebooks/data/train/cat.9900.jpg"
        string_val: "/notebooks/data/train/dog.4459.jpg"
        string_val: "/notebooks/data/train/dog.10945.jpg"
        string_val: "/notebooks/data/train/dog.2494.jpg"
        string_val: "/notebooks/data/train/dog.4850.jpg"
        string_val: "/notebooks/data/train/dog.8500.jpg"
        string_val: "/notebooks/data/train/cat.425.jpg"
        string_val: "/notebooks/data/train/dog.2695.jpg"
        string_val: "/notebooks/data/train/cat.4161.jpg"
        string_val: "/notebooks/data/train/cat.3328.jpg"
        string_val: "/notebooks/data/train/cat.4919.jpg"
        string_val: "/notebooks/data/train/dog.9150.jpg"
        string_val: "/notebooks/data/train/cat.8739.jpg"
        string_val: "/notebooks/data/train/cat.2744.jpg"
        string_val: "/notebooks/data/train/cat.6916.jpg"
        string_val: "/notebooks/data/train/dog.6648.jpg"
        string_val: "/notebooks/data/train/cat.5511.jpg"
        string_val: "/notebooks/data/train/dog.5568.jpg"
        string_val: "/notebooks/data/train/dog.2872.jpg"
        string_val: "/notebooks/data/train/cat.10900.jpg"
        string_val: "/notebooks/data/train/cat.12471.jpg"
        string_val: "/notebooks/data/train/cat.8028.jpg"
        string_val: "/notebooks/data/train/dog.3468.jpg"
        string_val: "/notebooks/data/train/dog.10972.jpg"
        string_val: "/notebooks/data/train/dog.10386.jpg"
        string_val: "/notebooks/data/train/dog.11748.jpg"
        string_val: "/notebooks/data/train/cat.11065.jpg"
        string_val: "/notebooks/data/train/dog.2797.jpg"
        string_val: "/notebooks/data/train/dog.1257.jpg"
        string_val: "/notebooks/data/train/dog.6957.jpg"
        string_val: "/notebooks/data/train/dog.6674.jpg"
        string_val: "/notebooks/data/train/cat.10609.jpg"
        string_val: "/notebooks/data/train/cat.9231.jpg"
        string_val: "/notebooks/data/train/dog.6670.jpg"
        string_val: "/notebooks/data/train/cat.2046.jpg"
        string_val: "/notebooks/data/train/dog.7120.jpg"
        string_val: "/notebooks/data/train/dog.6211.jpg"
        string_val: "/notebooks/data/train/dog.7050.jpg"
        string_val: "/notebooks/data/train/cat.3258.jpg"
        string_val: "/notebooks/data/train/dog.1786.jpg"
        string_val: "/notebooks/data/train/cat.10951.jpg"
        string_val: "/notebooks/data/train/cat.8273.jpg"
        string_val: "/notebooks/data/train/dog.700.jpg"
        string_val: "/notebooks/data/train/cat.4224.jpg"
        string_val: "/notebooks/data/train/cat.943.jpg"
        string_val: "/notebooks/data/train/dog.445.jpg"
        string_val: "/notebooks/data/train/dog.11330.jpg"
        string_val: "/notebooks/data/train/dog.8522.jpg"
        string_val: "/notebooks/data/train/cat.5308.jpg"
        string_val: "/notebooks/data/train/cat.5114.jpg"
        string_val: "/notebooks/data/train/dog.9112.jpg"
        string_val: "/notebooks/data/train/dog.7951.jpg"
        string_val: "/notebooks/data/train/cat.3880.jpg"
        string_val: "/notebooks/data/train/dog.11512.jpg"
        string_val: "/notebooks/data/train/cat.8164.jpg"
        string_val: "/notebooks/data/train/dog.5101.jpg"
        string_val: "/notebooks/data/train/dog.11143.jpg"
        string_val: "/notebooks/data/train/cat.7884.jpg"
        string_val: "/notebooks/data/train/cat.9333.jpg"
        string_val: "/notebooks/data/train/cat.4815.jpg"
        string_val: "/notebooks/data/train/dog.4638.jpg"
        string_val: "/notebooks/data/train/dog.6418.jpg"
        string_val: "/notebooks/data/train/cat.6726.jpg"
        string_val: "/notebooks/data/train/cat.9932.jpg"
        string_val: "/notebooks/data/train/cat.4968.jpg"
        string_val: "/notebooks/data/train/cat.2847.jpg"
        string_val: "/notebooks/data/train/dog.5461.jpg"
        string_val: "/notebooks/data/train/cat.11121.jpg"
        string_val: "/notebooks/data/train/cat.6838.jpg"
        string_val: "/notebooks/data/train/dog.624.jpg"
        string_val: "/notebooks/data/train/cat.9758.jpg"
        string_val: "/notebooks/data/train/dog.4704.jpg"
        string_val: "/notebooks/data/train/dog.7837.jpg"
        string_val: "/notebooks/data/train/cat.4190.jpg"
        string_val: "/notebooks/data/train/cat.6405.jpg"
        string_val: "/notebooks/data/train/cat.5416.jpg"
        string_val: "/notebooks/data/train/cat.170.jpg"
        string_val: "/notebooks/data/train/cat.10148.jpg"
        string_val: "/notebooks/data/train/cat.9508.jpg"
        string_val: "/notebooks/data/train/cat.7322.jpg"
        string_val: "/notebooks/data/train/dog.9971.jpg"
        string_val: "/notebooks/data/train/dog.1430.jpg"
        string_val: "/notebooks/data/train/cat.2209.jpg"
        string_val: "/notebooks/data/train/cat.5995.jpg"
        string_val: "/notebooks/data/train/cat.8300.jpg"
        string_val: "/notebooks/data/train/dog.11375.jpg"
        string_val: "/notebooks/data/train/cat.8762.jpg"
        string_val: "/notebooks/data/train/dog.8111.jpg"
        string_val: "/notebooks/data/train/dog.1933.jpg"
        string_val: "/notebooks/data/train/dog.540.jpg"
        string_val: "/notebooks/data/train/dog.3084.jpg"
        string_val: "/notebooks/data/train/dog.11227.jpg"
        string_val: "/notebooks/data/train/cat.8585.jpg"
        string_val: "/notebooks/data/train/cat.6230.jpg"
        string_val: "/notebooks/data/train/dog.7974.jpg"
        string_val: "/notebooks/data/train/cat.12037.jpg"
        string_val: "/notebooks/data/train/cat.3179.jpg"
        string_val: "/notebooks/data/train/cat.1522.jpg"
        string_val: "/notebooks/data/train/cat.1375.jpg"
        string_val: "/notebooks/data/train/cat.3483.jpg"
        string_val: "/notebooks/data/train/cat.3523.jpg"
        string_val: "/notebooks/data/train/dog.9868.jpg"
        string_val: "/notebooks/data/train/cat.2235.jpg"
        string_val: "/notebooks/data/train/cat.10628.jpg"
        string_val: "/notebooks/data/train/cat.10802.jpg"
        string_val: "/notebooks/data/train/cat.1307.jpg"
        string_val: "/notebooks/data/train/dog.5085.jpg"
        string_val: "/notebooks/data/train/dog.9872.jpg"
        string_val: "/notebooks/data/train/dog.10140.jpg"
        string_val: "/notebooks/data/train/cat.5338.jpg"
        string_val: "/notebooks/data/train/cat.17.jpg"
        string_val: "/notebooks/data/train/cat.1792.jpg"
        string_val: "/notebooks/data/train/cat.2097.jpg"
        string_val: "/notebooks/data/train/dog.4981.jpg"
        string_val: "/notebooks/data/train/dog.149.jpg"
        string_val: "/notebooks/data/train/cat.12409.jpg"
        string_val: "/notebooks/data/train/dog.7505.jpg"
        string_val: "/notebooks/data/train/dog.2893.jpg"
        string_val: "/notebooks/data/train/cat.10551.jpg"
        string_val: "/notebooks/data/train/dog.11422.jpg"
        string_val: "/notebooks/data/train/dog.7370.jpg"
        string_val: "/notebooks/data/train/cat.411.jpg"
        string_val: "/notebooks/data/train/cat.10242.jpg"
        string_val: "/notebooks/data/train/dog.7992.jpg"
        string_val: "/notebooks/data/train/cat.6615.jpg"
        string_val: "/notebooks/data/train/dog.6738.jpg"
        string_val: "/notebooks/data/train/dog.9948.jpg"
        string_val: "/notebooks/data/train/cat.10128.jpg"
        string_val: "/notebooks/data/train/dog.801.jpg"
        string_val: "/notebooks/data/train/dog.10584.jpg"
        string_val: "/notebooks/data/train/dog.769.jpg"
        string_val: "/notebooks/data/train/dog.11221.jpg"
        string_val: "/notebooks/data/train/dog.1833.jpg"
        string_val: "/notebooks/data/train/dog.946.jpg"
        string_val: "/notebooks/data/train/dog.5275.jpg"
        string_val: "/notebooks/data/train/cat.11757.jpg"
        string_val: "/notebooks/data/train/dog.11203.jpg"
        string_val: "/notebooks/data/train/dog.3376.jpg"
        string_val: "/notebooks/data/train/dog.8403.jpg"
        string_val: "/notebooks/data/train/cat.831.jpg"
        string_val: "/notebooks/data/train/dog.3965.jpg"
        string_val: "/notebooks/data/train/dog.2364.jpg"
        string_val: "/notebooks/data/train/cat.1756.jpg"
        string_val: "/notebooks/data/train/dog.7308.jpg"
        string_val: "/notebooks/data/train/cat.5319.jpg"
        string_val: "/notebooks/data/train/dog.11584.jpg"
        string_val: "/notebooks/data/train/cat.3007.jpg"
        string_val: "/notebooks/data/train/cat.4865.jpg"
        string_val: "/notebooks/data/train/dog.1874.jpg"
        string_val: "/notebooks/data/train/cat.6644.jpg"
        string_val: "/notebooks/data/train/dog.12404.jpg"
        string_val: "/notebooks/data/train/cat.7354.jpg"
        string_val: "/notebooks/data/train/dog.605.jpg"
        string_val: "/notebooks/data/train/dog.4237.jpg"
        string_val: "/notebooks/data/train/cat.3754.jpg"
        string_val: "/notebooks/data/train/cat.2106.jpg"
        string_val: "/notebooks/data/train/cat.11995.jpg"
        string_val: "/notebooks/data/train/dog.9147.jpg"
        string_val: "/notebooks/data/train/dog.3077.jpg"
        string_val: "/notebooks/data/train/cat.10720.jpg"
        string_val: "/notebooks/data/train/dog.5449.jpg"
        string_val: "/notebooks/data/train/cat.4391.jpg"
        string_val: "/notebooks/data/train/dog.12124.jpg"
        string_val: "/notebooks/data/train/dog.1649.jpg"
        string_val: "/notebooks/data/train/cat.11494.jpg"
        string_val: "/notebooks/data/train/cat.7585.jpg"
        string_val: "/notebooks/data/train/cat.4414.jpg"
        string_val: "/notebooks/data/train/dog.2622.jpg"
        string_val: "/notebooks/data/train/dog.3484.jpg"
        string_val: "/notebooks/data/train/dog.2576.jpg"
        string_val: "/notebooks/data/train/dog.5507.jpg"
        string_val: "/notebooks/data/train/cat.6080.jpg"
        string_val: "/notebooks/data/train/cat.8760.jpg"
        string_val: "/notebooks/data/train/dog.8633.jpg"
        string_val: "/notebooks/data/train/dog.6728.jpg"
        string_val: "/notebooks/data/train/dog.7003.jpg"
        string_val: "/notebooks/data/train/cat.6874.jpg"
        string_val: "/notebooks/data/train/cat.7164.jpg"
        string_val: "/notebooks/data/train/dog.5471.jpg"
        string_val: "/notebooks/data/train/cat.7202.jpg"
        string_val: "/notebooks/data/train/cat.5684.jpg"
        string_val: "/notebooks/data/train/cat.6542.jpg"
        string_val: "/notebooks/data/train/cat.6097.jpg"
        string_val: "/notebooks/data/train/cat.9335.jpg"
        string_val: "/notebooks/data/train/cat.3694.jpg"
        string_val: "/notebooks/data/train/dog.12431.jpg"
        string_val: "/notebooks/data/train/dog.2941.jpg"
        string_val: "/notebooks/data/train/dog.2974.jpg"
        string_val: "/notebooks/data/train/dog.3814.jpg"
        string_val: "/notebooks/data/train/dog.12314.jpg"
        string_val: "/notebooks/data/train/dog.11405.jpg"
        string_val: "/notebooks/data/train/dog.2498.jpg"
        string_val: "/notebooks/data/train/cat.11933.jpg"
        string_val: "/notebooks/data/train/dog.10802.jpg"
        string_val: "/notebooks/data/train/cat.980.jpg"
        string_val: "/notebooks/data/train/cat.4762.jpg"
        string_val: "/notebooks/data/train/cat.10331.jpg"
        string_val: "/notebooks/data/train/dog.3018.jpg"
        string_val: "/notebooks/data/train/cat.1635.jpg"
        string_val: "/notebooks/data/train/dog.7114.jpg"
        string_val: "/notebooks/data/train/cat.4358.jpg"
        string_val: "/notebooks/data/train/dog.6154.jpg"
        string_val: "/notebooks/data/train/dog.902.jpg"
        string_val: "/notebooks/data/train/dog.2957.jpg"
        string_val: "/notebooks/data/train/cat.11598.jpg"
        string_val: "/notebooks/data/train/dog.8841.jpg"
        string_val: "/notebooks/data/train/cat.3968.jpg"
        string_val: "/notebooks/data/train/cat.6033.jpg"
        string_val: "/notebooks/data/train/cat.2803.jpg"
        string_val: "/notebooks/data/train/cat.9413.jpg"
        string_val: "/notebooks/data/train/cat.1264.jpg"
        string_val: "/notebooks/data/train/cat.3775.jpg"
        string_val: "/notebooks/data/train/cat.173.jpg"
        string_val: "/notebooks/data/train/dog.11808.jpg"
        string_val: "/notebooks/data/train/cat.6856.jpg"
        string_val: "/notebooks/data/train/dog.5342.jpg"
        string_val: "/notebooks/data/train/dog.2712.jpg"
        string_val: "/notebooks/data/train/dog.12469.jpg"
        string_val: "/notebooks/data/train/cat.4548.jpg"
        string_val: "/notebooks/data/train/cat.1989.jpg"
        string_val: "/notebooks/data/train/dog.12154.jpg"
        string_val: "/notebooks/data/train/dog.388.jpg"
        string_val: "/notebooks/data/train/cat.2428.jpg"
        string_val: "/notebooks/data/train/dog.5366.jpg"
        string_val: "/notebooks/data/train/dog.11890.jpg"
        string_val: "/notebooks/data/train/dog.2647.jpg"
        string_val: "/notebooks/data/train/dog.4763.jpg"
        string_val: "/notebooks/data/train/dog.3771.jpg"
        string_val: "/notebooks/data/train/cat.1401.jpg"
        string_val: "/notebooks/data/train/cat.9190.jpg"
        string_val: "/notebooks/data/train/dog.6621.jpg"
        string_val: "/notebooks/data/train/dog.8767.jpg"
        string_val: "/notebooks/data/train/cat.4922.jpg"
        string_val: "/notebooks/data/train/cat.5248.jpg"
        string_val: "/notebooks/data/train/dog.2149.jpg"
        string_val: "/notebooks/data/train/cat.4147.jpg"
        string_val: "/notebooks/data/train/dog.1274.jpg"
        string_val: "/notebooks/data/train/cat.8906.jpg"
        string_val: "/notebooks/data/train/dog.6453.jpg"
        string_val: "/notebooks/data/train/dog.320.jpg"
        string_val: "/notebooks/data/train/cat.1776.jpg"
        string_val: "/notebooks/data/train/dog.10221.jpg"
        string_val: "/notebooks/data/train/dog.10053.jpg"
        string_val: "/notebooks/data/train/cat.11487.jpg"
        string_val: "/notebooks/data/train/dog.4568.jpg"
        string_val: "/notebooks/data/train/cat.1688.jpg"
        string_val: "/notebooks/data/train/dog.7593.jpg"
        string_val: "/notebooks/data/train/cat.2199.jpg"
        string_val: "/notebooks/data/train/cat.9989.jpg"
        string_val: "/notebooks/data/train/cat.2627.jpg"
        string_val: "/notebooks/data/train/dog.12436.jpg"
        string_val: "/notebooks/data/train/cat.10260.jpg"
        string_val: "/notebooks/data/train/dog.8844.jpg"
        string_val: "/notebooks/data/train/dog.8334.jpg"
        string_val: "/notebooks/data/train/cat.9448.jpg"
        string_val: "/notebooks/data/train/cat.3276.jpg"
        string_val: "/notebooks/data/train/dog.9779.jpg"
        string_val: "/notebooks/data/train/cat.5166.jpg"
        string_val: "/notebooks/data/train/cat.6648.jpg"
        string_val: "/notebooks/data/train/cat.6262.jpg"
        string_val: "/notebooks/data/train/dog.9985.jpg"
        string_val: "/notebooks/data/train/cat.9832.jpg"
        string_val: "/notebooks/data/train/cat.7215.jpg"
        string_val: "/notebooks/data/train/dog.9762.jpg"
        string_val: "/notebooks/data/train/cat.10340.jpg"
        string_val: "/notebooks/data/train/dog.4118.jpg"
        string_val: "/notebooks/data/train/cat.2323.jpg"
        string_val: "/notebooks/data/train/cat.758.jpg"
        string_val: "/notebooks/data/train/cat.3741.jpg"
        string_val: "/notebooks/data/train/dog.9702.jpg"
        string_val: "/notebooks/data/train/cat.2918.jpg"
        string_val: "/notebooks/data/train/cat.6186.jpg"
        string_val: "/notebooks/data/train/cat.9858.jpg"
        string_val: "/notebooks/data/train/cat.3174.jpg"
        string_val: "/notebooks/data/train/cat.5534.jpg"
        string_val: "/notebooks/data/train/dog.7339.jpg"
        string_val: "/notebooks/data/train/cat.11192.jpg"
        string_val: "/notebooks/data/train/dog.4291.jpg"
        string_val: "/notebooks/data/train/dog.1085.jpg"
        string_val: "/notebooks/data/train/cat.2851.jpg"
        string_val: "/notebooks/data/train/cat.155.jpg"
        string_val: "/notebooks/data/train/cat.1028.jpg"
        string_val: "/notebooks/data/train/dog.8882.jpg"
        string_val: "/notebooks/data/train/dog.8365.jpg"
        string_val: "/notebooks/data/train/dog.4678.jpg"
        string_val: "/notebooks/data/train/dog.6487.jpg"
        string_val: "/notebooks/data/train/dog.10308.jpg"
        string_val: "/notebooks/data/train/cat.1493.jpg"
        string_val: "/notebooks/data/train/dog.10670.jpg"
        string_val: "/notebooks/data/train/dog.2443.jpg"
        string_val: "/notebooks/data/train/dog.6964.jpg"
        string_val: "/notebooks/data/train/dog.9172.jpg"
        string_val: "/notebooks/data/train/cat.549.jpg"
        string_val: "/notebooks/data/train/dog.857.jpg"
        string_val: "/notebooks/data/train/cat.2434.jpg"
